//- Користувач вводить або має два числа.
//    Потрібно знайти та вивести максимальне число з тих двох .
//    Також потрібно врахувати коли введені рівні числа.

// let num1 = prompt("first");
// let num2 = prompt("second");
//
// if (num1 > num2) {
//     console.log(num1);
// }else if (num1 < num2) {
//     console.log(num2)
// }else {
//     console.log("opa")
// }


//- У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
//Користувач вводить номер квартири просто в змінні або через prompt('') .
//    Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let number = prompt("Номер квартири")
//
// if (number > 0 && number <= 20) {
//     console.log(`Квартира ${number} у першому підїзді`);
// } else if (number >= 21 && number <= 48) {
//     console.log(`Квартира ${number} у другому підїзді`);
// } else if (number >= 49 && number <= 90) {
//     console.log(`Квартира ${number} у третьому підїзді`);
// }


//- Ми маємо змінну number в яку користувач задає числове значення,
//якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let number1 = prompt("number");
//
// if (number1 == 10) {
//     console.log("true");
// } else {
//     console.log("false");
// }

//- Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//  якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
//  якщо в змінну записали щось інше, спрацьовує else


// let x
// if (typeof x === "number") {
//     console.log(1)
// } else if (typeof x === "string") {
//     console.log(2)
// } else if (typeof x === "boolean") {
//     console.log(3)
// } else if (typeof x === "object") {
//     console.log(4)
// } else {
//     console.log("wrong")
// }



// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН


// let temp = prompt("Яка температура?");
//
// if (temp >= 10 && temp <= 22) {
//     console.log("ми йдемо ВЧИТИСЯ");
// } else {
//     console.log("сидимо вдома і вчимося ОНЛАЙН");
// }

//
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
//
// let number = +prompt("Ведіть число від 1 до 5")
//
// switch (number) {
//     case 1:
//         console.log("Авто");
//         break
//     case 2:
//         console.log("Мото");
//         break
//     case 3:
//         console.log("Телефон");
//         break
//     case 4:
//         console.log("book")
//         break
//     case 5:
//         console.log("MP3 player")
//         break
//     default:
//         console.log("Wrong")
// }